      * Copybook wsfst
      * Basic use
      * Create 01
      * 01  WS-FILE-STATUS.
      * replace tag with file name designator.

           12 WS-:tag:-Status            pic x(2).
              88 WS-:tag:-EOF            value "10".
              88 WS-:tag:-Good           value "00".
              88 WS-:tag:-Okay           values "00" "10".
