//RTPOT33D JOB ,
// MSGCLASS=H,MSGLEVEL=(1,1),TIME=(,4),REGION=144M,COND=(16,LT)
//*
//STP0000 EXEC PROC=ELAXFCOC,
// CICS=,
// DB2=,
// COMP=,
// PARM.COBOL=('SQL',
// 'LIB,TEST(NOHOOK,SEP,EJPD)')
//COBOL.SYSPRINT DD SYSOUT=*
//COBOL.SYSDEBUG DD DISP=SHR,
//        DSN=RTPOT33.LEARN.SYSDEBUG(DB2TEST)
//COBOL.SYSLIN DD DISP=SHR,
//        DSN=RTPOT33.LEARN.OBJ(DB2TEST)
//COBOL.DBRMLIB  DD  DISP=SHR,
//        DSN=RTPOT33.LEARN.DBRMLIB(DB2TEST)
//COBOL.SYSLIB DD DISP=SHR,
//        DSN=DDS0001.COBOL.COPYLIB
//COBOL.SYSXMLSD DD DUMMY
//COBOL.SYSIN DD DISP=SHR,
//        DSN=RTPOT33.LEARN.COBOL(DB2TEST)
//*
//******* ADDITIONAL JCL FOR COMPILE HERE ******
//LKED EXEC PROC=ELAXFLNK
//LINK.SYSPRINT DD SYSOUT=*
//LINK.SYSLIB DD DSN=RTPOT33.LEARN.LOAD,
//            DISP=SHR
//            DD DSN=DB2.V11.SDSNLOAD,
//            DISP=SHR
//            DD DSN=CEE.SCEELKED,
//            DISP=SHR
//LINK.OBJ0000 DD DISP=SHR,
//        DSN=RTPOT33.LEARN.OBJ(DB2TEST)
//LINK.SYSLIN DD *
     INCLUDE OBJ0000
/*
//LINK.SYSLMOD   DD  DISP=SHR,
//        DSN=RTPOT33.LEARN.LOAD(DB2TEST)
//*
//******* ADDITIONAL JCL FOR LINK HERE ******
//BIND EXEC PGM=IKJEFT01
//SYSPRINT DD SYSOUT=*
//SYSTSPRT DD SYSOUT=*
//DBRMLIB  DD  DSN=RTPOT33.LEARN.DBRMLIB,DISP=SHR
//SYSTSIN   DD  *
     TSOLIB ACTIVATE DA('DB2.V11.SDSNLOAD')
     DSN SYSTEM(DB1S)
     BIND PLAN(DB2TEST) -
     OWNER(RTPOT33) -
     MEMBER(DB2TEST) -
     LIBRARY('RTPOT33.LEARN.DBRMLIB') -
     ACTION(REP) -
     VALIDATE(RUN)
     END
/*
//TRTMNT EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB   DD DSN=DDS0001.TEST.LOAD,DISP=SHR
            DD DSN=DB2.V11.SDSNLOAD,DISP=SHR
            DD DSN=DB2.V11.DSNA.RUNLIB.LOAD,DISP=SHR
            DD DSN=DB2.V11.DSNA.ENFM.SDSNSAMP,DISP=SHR
            DD DSN=DB2.V11.DSNA.SDSNTEMP,DISP=SHR
            DD DSN=DB2.V11.DSNA.SDSNEXIT,DISP=SHR
//CEEOPTS DD *
  TEST(,,,DBMDT%RTPOT33:)
/*
//SYSPRINT  DD SYSOUT=*
//SYSOUT    DD SYSOUT=*
//SYSTSPRT  DD SYSOUT=*
//DBRMLIB  DD  DSN=RTPOT33.LEARN.DBRMLIB,DISP=SHR
//SYSTSIN   DD *
  TSOLIB ACTIVATE DA('DB2.V11.SDSNLOAD')
  DSN SYSTEM(DB1S)
  RUN PROGRAM(DB2TEST) PLAN(DB2TEST) -
  LIB('RTPOT33.LEARN.LOAD')
END
/*
