//HERC0372 JOB  1,MSGCLASS=H,NOTIFY=HERC03
//COBRUN   EXEC COBUCG
//COB.SYSIN    DD DSNAME=HERC03.CBL(BDS0802),DISP=SHR
//COB.SYSLIB   DD DSNAME=SYS1.COBLIB,DISP=SHR
//COB.SYSOUT   DD SYSOUT=*
//COB.SYSPUNCH DD SYSOUT=*
//GO.SHOPFILE  DD DISP=SHR,DSNAME=HERC03.CH8.SHOP2
//GO.SYSOUT    DD SYSOUT=*
