//HERC0374 JOB  1,MSGCLASS=H,NOTIFY=HERC03
//COBRUN   EXEC COBUCG
//COB.SYSIN    DD DISP=SHR,DSNAME=HERC03.CBL(BDS0704)
//COB.SYSLIB   DD DISP=SHR,DSNAME=SYS1.COBLIB
//COB.SYSOUT   DD SYSOUT=*
//COB.SYSPUNCH DD SYSOUT=*
//GO.GADGETS   DD DISP=SHR,DSNAME=HERC03.CH7.GADGETS
//GO.SYSOUT    DD SYSOUT=*