       IDENTIFICATION DIVISION.
       PROGRAM-ID. CNTRLCOB.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SORT-IN-FILE ASSIGN TO INFILE.
                SELECT SORT-OUT-FILE ASSIGN TO OUTFILE.
                SELECT WORK-FILE ASSIGN TO WRKFILE.
       DATA DIVISION.
       FILE SECTION.
       FD  SORT-IN-FILE.
       01 INPUT-STUDENT.
            05 STUDENT-ID-I PIC 9(5).
            05 STUDENT-NAME-I PIC X(25).
       FD  SORT-OUT-FILE.
       01  OUTPUT-STUDENT.
           05 STUDENT-ID-O PIC 9(5).
           05 STUDENT-NAME-O PIC X(25).
       SD  WORK-FILE.
       01  WORK-STUDENT.
           05 STUDENT-ID-W PIC 9(5).
           05 STUDENT-NAME-W PIC X(25).

       PROCEDURE DIVISION.
           SORT WORK-FILE ON ASCENDING KEY STUDENT-ID-W
            USING SORT-IN-FILE GIVING SORT-OUT-FILE.
           DISPLAY 'Sort Successful'.
           GOBACK.



