       IDENTIFICATION DIVISION.
       PROGRAM-ID. COBSRT1
      ** Vacation Rental properties program
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT SORT-IN-FILE ASSIGN TO RENTALS
                        FILE STATUS IS RE.
           SELECT SORT-OUT-FILE ASSIGN TO RENTSORT
                        FILE STATUS IS RS.
           SELECT WORK-FILE ASSIGN TO WRKFILE.
       DATA DIVISION.
       FILE SECTION.
       FD  SORT-IN-FILE.
       01  INPUT-RENTAL.
            05 RENTAL-ID-I PIC 9(5).
            05 RENTAL-NAME-I PIC X(25).
            05 FILLER PIC X(26).
       FD  SORT-OUT-FILE.
       01  OUTPUT-RENTAL.
           05 RENTAL-ID-O PIC 9(5).
           05 RENTAL-NAME-O PIC X(25).
           05 FILLER PIC X(26).
       SD  WORK-FILE
           RECORD CONTAINS 56 CHARACTERS
           DATA RECORD IS WORK-RENTAL.
       01  WORK-RENTAL.
           05 RENTAL-ID-W PIC 9(5).
           05 RENTAL-NAME-W PIC X(25).
           05 FILLER PIC X(26).
       WORKING-STORAGE SECTION.
       77  RE    PIC X(02).
       77  RS   PIC X(02).
       77  OFCODE   PIC X(01).

       PROCEDURE DIVISION.
           OPEN INPUT  SORT-IN-FILE
               OUTPUT SORT-OUT-FILE.
           SORT WORK-FILE ON DESCENDING KEY RENTAL-ID-W
                INPUT  PROCEDURE 200-SRT-INPUT-PROCD
                OUTPUT PROCEDURE 300-SRT-OUTPUT-PROCD.
           DISPLAY 'Sort Successful'.
           GOBACK.
       200-SRT-INPUT-PROCD SECTION.
           READ SORT-IN-FILE AT END MOVE 'Y' TO OFCODE.
           MOVE INPUT-RENTAL TO WORK-RENTAL.
           RELEASE WORK-RENTAL.
       300-SRT-OUTPUT-PROCD SECTION.
           MOVE 'N' TO OFCODE.
           RETURN WORK-FILE
                AT END MOVE 'Y' TO OFCODE.
           MOVE WORK-RENTAL TO OUTPUT-RENTAL.
           WRITE OUTPUT-RENTAL.