       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOVB.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT PAYCHECK
           ASSIGN TO UT-S-PAYVB
             ACCESS MODE IS SEQUENTIAL
             FILE STATUS IS WS-FS.
       DATA DIVISION.
       FILE SECTION.
       FD  PAYCHECK
           RECORDING MODE IS V
           LABEL RECORDS ARE STANDARD
           RECORD VARYING FROM 1 TO 80
           DEPENDING ON WS-REC-SZ
           DATA RECORD IS PAYCHECK-REC.
       01  PAYCHECK-REC  PIC X(80).
       WORKING-STORAGE SECTION.
       77  WS-REC-SZ                   PIC 999   VALUE ZERO.
       77  WS-FS                       PIC XX.
       PROCEDURE DIVISION.
           OPEN OUTPUT PAYCHECK.
           MOVE '123456789012345' TO PAYCHECK-REC.
           MOVE 15 TO WS-REC-SZ.
           WRITE PAYCHECK-REC.
           CLOSE PAYCHECK.
           GOBACK.
