       IDENTIFICATION DIVISION.
       PROGRAM-ID.  BDS0704.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT GADGETFILE ASSIGN TO DA-S-GADGETS.

       DATA DIVISION.
       FILE SECTION.
       FD  GADGETFILE
           LABEL RECORDS ARE STANDARD
           RECORDING MODE IS F
           BLOCK CONTAINS 0 RECORDS
           RECORD CONTAINS 46 CHARACTERS.
       01  STOCKREC.
           02 GADGETID         PIC 9(6).
           02 GADGETNAME       PIC X(30).
           02 QTYINSTOCK       PIC 9(4).
           02 PRICE            PIC 9(4)V99.

       WORKING-STORAGE SECTION.
       01  WS-FILE-STATUS.
           12 WS-EOF            PIC X(1) VALUE 'N'.

       01  PRNSTOCKVALUE.
           02 PRNGADGETNAME      PIC X(30).
           02 FILLER             PIC XX VALUE SPACES.
           02 PRNVALUE           PIC $$$,$$9.99.

       01  PRNFINALSTOCKTOTAL.
           02 FILLER              PIC X(16) VALUE SPACES.
           02 FILLER              PIC X(16) VALUE 'STOCK TOTAL:'.
           02 PRNFINALTOTAL       PIC $$$,$$9.99.

       01  FINALSTOCKTOTAL        PIC 9(6)V99.
       01  STOCKVALUE             PIC 9(6)V99.


       PROCEDURE DIVISION.
       0000-MAINLINE.
           PERFORM 1000-BEGIN-JOB.
           PERFORM 2000-PROCESS.
           PERFORM 3000-END-JOB.
           STOP RUN.

       1000-BEGIN-JOB.
           MOVE ZEROS TO FINALSTOCKTOTAL.
           MOVE ZEROS TO STOCKVALUE.
           OPEN INPUT GADGETFILE.
           READ GADGETFILE AT END MOVE 'Y' TO WS-EOF.

       2000-PROCESS.
           PERFORM 5010-DISPLAYVALUES UNTIL WS-EOF = 'Y'.
           MOVE FINALSTOCKTOTAL TO PRNFINALTOTAL.
           DISPLAY PRNFINALSTOCKTOTAL.

       3000-END-JOB.
           CLOSE GADGETFILE.

       5010-DISPLAYVALUES.
           COMPUTE STOCKVALUE = PRICE * QTYINSTOCK
           ADD STOCKVALUE  TO FINALSTOCKTOTAL.
           MOVE GADGETNAME TO PRNGADGETNAME.
           MOVE STOCKVALUE TO PRNVALUE.
           DISPLAY PRNSTOCKVALUE.
           READ GADGETFILE AT END MOVE 'Y' TO WS-EOF.
