       program-id. base_mf.

       environment division.
       configuration section.

       data division.
       working-storage section.

       procedure division.

           goback.

       end program base_mf.
