       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM-NAME.
       AUTHOR. DAVID.
       INSTALLATION. where.
       DATE-WRITTEN. dd/mm/yyyy.
       DATE-COMPILED.dd/mm/yyyy.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. PC.
       OBJECT-COMPUTER. PC.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
        FILE SECTION.
        WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
        main-processing SECTION.
         mainline-paragraph.

             STOP RUN.
       END PROGRAM base_ibm.
