      ******************************************************************
      * AUTHOR:
      * date:
      * purpose:
      * tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. smallestprogram.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello World"
            STOP RUN.
       END PROGRAM smallestprogram.
